In [2]:
import pandas as pd
df = pd.DataFrame({
                'a':[1,2,3,4],
                'b':[5,6,7,5],
                'c':['w','x','y','z']
                })
df

   a  b  c
0  1  5  w
1  2  6  x
2  3  7  y
3  4  5  z

In [3]:
df['b'].unique()

array([5, 6, 7])

In [4]:
df['b'].nunique()       #returns the length of unique numbers in array

3

In [6]:
df['b'].value_counts()

5    2
6    1
7    1
Name: b, dtype: int64

## Applied functions

In [7]:
def double(x):
    return x*2

In [8]:
df['a'].apply(double)

0    2
1    4
2    6
3    8
Name: a, dtype: int64

In [10]:
df['c'].apply(len)

0    1
1    1
2    1
3    1
Name: c, dtype: int64

In [11]:
df['b'].apply(lambda x: x*2)

0    10
1    12
2    14
3    10
Name: b, dtype: int64

In [13]:
df.sort_values(by='b')

   a  b  c
0  1  5  w
3  4  5  z
1  2  6  x
2  3  7  y